[
	{
		"title": "Apollo Command Module Carrier",
		"tags": "",
		"body": "The Apollo 11 Command Module, \"Columbia,\" was the living quarters for the three-person crew during most of the first crewed lunar landing mission in July 1969. On July 16, 1969, Neil Armstrong, Edwin \"Buzz\" Aldrin and Michael Collins were launched from Cape Kennedy atop a Saturn V rocket. This Command Module, no. 107, manufactured by North American Rockwell, was one of three parts of the complete Apollo spacecraft. The other two parts were the Service Module and the Lunar Module, nicknamed \"Eagle.\" The Service Module contained the main spacecraft propulsion system and consumables while the Lunar Module was the two-person craft used by Armstrong and Aldrin to descend to the Moon's surface on July 20. The Command Module is the only portion of the spacecraft to return to Earth. <<image none>> <<video none>>[[Introduction to Columbia]][[Doors and Windows]][[Looking Out]][[EVA Handles]][[Disposing of Liquid Waste]][[Radio Communication]][[A Multipurpose Opening]][[Reaction Control Systems]][[Central Heat Shield]][[CM Guidance System Instruments]][[Connecting Columbia to the Service Module]][[Command Module Exterior]][[Aft Heat Shield and Aft Compartment]][[Ablative Material: Thermal Protection]][[Compression Pads and Tension Ties]][[A Series of Parachutes Slows the Descent]][[Forward Heat Shield: Jettisoned During Reentry]][[Aids for Ocean Recovery]][[Pilot Parachutes Deploy the Main Parachutes]][[Forward Compartment]][[Crew Access Hatch: Exterior Features]]",
		"position": {
			"x": -2940,
			"y": -1047
		},
		"colorID": 1
	},
	{
		"title": "Introduction to Columbia",
		"tags": "",
		"body": "Columbia was both the command center for the Apollo 11 mission and living quarters for the 3-person crew for most of the journey. The command module is the only part of the spacecraft (which includes the service module and lunar module) that was recovered. The command module contained everything the astronauts needed to control the spacecraft and keep themselves alive on the journey, all sealed into a working space slightly less than four meters across by just over three meters high. Together with the service module, the spacecraft provided the crew with food, water, a temperature-controlled environment and power. Columbia has systems for navigation, control, communications, and propulsion. <<image none>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2581,
			"y": -1495
		},
		"colorID": 1
	},
	{
		"title": "Doors and Windows",
		"tags": "",
		"body": "The main door or hatch opens outward and is about 29 inches high by 34 inches wide. The hatch has a 9-inch round window which can be replaced by an air lock. In addition to the hatch window, Columbia is equipped with two side windows and two rendezvous or docking windows. <<image 01>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2358,
			"y": -1490
		},
		"colorID": 1
	},
	{
		"title": "Looking Out",
		"tags": "",
		"body": "The inner windows are double-paned, made of tempered silica glass, designed to function at temperatures greater than 2000F. The outer windows are made of a single silicone pane, with an anti-reflective coating for filtering out most infrared and all ultraviolet rays. The outside glass has a melting point of 3110F. Columbias crew took photographs through the two side windows, located on either side of the row of astronauts couches. The rendezvous windows, 8 by 13 inches, give the astronauts a view of the forward, or apex end of the command module, and were used during rendezvous and docking maneuvers. The small hatch window is positioned over the center couch.<<image 02>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2138,
			"y": -1492
		},
		"colorID": 1
	},
	{
		"title": "EVA Handles",
		"tags": "",
		"body": "The fixed handles are aluminum, oval-shaped tubes 12 inches long with a support fitting at each end. The handles are used for planned or unplanned space walks, referred to by NASA as Extra Vehicular Activity (EVA). The hatch has a smaller fixed handle near the latch mechanism that is used for opening the hatch. All the handle supports are bolted into fiberglass inserts into the ablative material. The handle supports have a small bar to which an EVA tether can be attached. The handle supports also contain the radio luminescent disks to enhance visibility. The disks are approximately 5/8 inch in diameter, glow in the dark and are slightly radioactive. Also located below the side hatch is an attach point for a sea anchor to be provided by Navy rescue crews after splashdown. <<image 03>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1915,
			"y": -1488
		},
		"colorID": 1
	},
	{
		"title": "Disposing of Liquid Waste",
		"tags": "",
		"body": "The white, semi-spherical nozzle on the left is used to expel urine, while the nozzle on the right is for waste water. Heaters, controlled from a panel inside the spacecraft, prevent ice from forming at the nozzles. <<image 04>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1696,
			"y": -1489
		},
		"colorID": 1
	},
	{
		"title": "Radio Communication",
		"tags": "",
		"body": "Antennas were used for radio communications in space, between the spacecraft and Mission Control and during the moon landing phase, between the separated command module and the lunar module. The spacecraft is equipped with systems for Very High Frequency (VHF) radio communications as well as the unified microwave S-band for both voice and data transmission. S-Band antennas are small white circular components, flush mounted near the blunt end of the command module. The antennas provided communications at a specific S-Band microwave frequency (2272.5 MHz). <<image 05>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1476,
			"y": -1489
		},
		"colorID": 1
	},
	{
		"title": "A Multipurpose Opening",
		"tags": "",
		"body": "The steam vent located on the side of the command module released excess heat in the form of steam. It could also be used after landing to collect seawater for desalinization through a tube passed through the opening to the outside. <<image 06>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1255,
			"y": -1488
		},
		"colorID": 1
	},
	{
		"title": "Reaction Control Systems",
		"tags": "",
		"body": "The Apollo command and service module when combined have two separate systems for controlling the spacecrafts motion, the command module and the service module systems. The command module thrusters control the pitch, yaw and rolling motion of the spacecraft during approach and reentry. The service module thrusters control the attitude during most of the mission. The thrusters can be operated automatically by the computers or manually from within the command module. <<image 07>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2575,
			"y": -1271
		},
		"colorID": 1
	},
	{
		"title": "Central Heat Shield",
		"tags": "",
		"body": "The central heat shield section has openings on one side for two side windows, two forward viewing windows, and a side hatch. On the other side is a fixture to attach an assembly called an umbilical to connect the command module to the service module. Also visible is a copper structure that supports the spacecrafts sextant and telescope. <<image 08>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2357,
			"y": -1275
		},
		"colorID": 1
	},
	{
		"title": "CM Guidance System Instruments",
		"tags": "",
		"body": "The command module navigation and guidance system included a sextant (on the right) and a telescope (on the left) used by the command module pilot for sighting guide stars and other features on the lunar surface. External apertures for both instruments are located above the umbilical connection. <<image 09>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2133,
			"y": -1270
		},
		"colorID": 1
	},
	{
		"title": "Connecting Columbia to the Service Module",
		"tags": "",
		"body": "During all but the final reentry phase of the mission, the command module and service module are connected by an umbilical though which water, coolant, and electrical power can be passed, one to the other. Just before separation of the CM and SM prior to reentry the umbilical connection is severed by an explosive device. <<image 10>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1913,
			"y": -1270
		},
		"colorID": 1
	},
	{
		"title": "Command Module Exterior",
		"tags": "",
		"body": "Three sections make up the outer structure of the command module: the forward, central and aft heat shields. The heat shields surface is a fiberglass honeycomb structure, filled with an epoxy resin, and brazed to a stainless steel substructure. The heat shields protect the astronauts from temperature extremes in the environment, including the heat generated during launch and reentry. In space the command modules surface is heated to 280F on the side facing the sun and cooled to 280F below zero on the side facing away. The shields are critical during the intense heat generated by reentry of the spacecraft into Earths atmosphere (about 5000F). <<image 11>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1683,
			"y": -1276
		},
		"colorID": 1
	},
	{
		"title": "Aft Heat Shield and Aft Compartment",
		"tags": "",
		"body": "The aft heat shield, a concave, saucer-shaped structure is made of the same ablative material as the central and forward heat shield. The aft shield protects a narrow storage compartment located beneath the crew compartment. The storage compartment is held in place by a ring around the circumference of the command module. The aft compartment contains ten reaction control engines, shock absorbers, instrumentation, and storage tanks for water, fuel oxidizer, and gaseous helium. <<image 12>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1461,
			"y": -1275
		},
		"colorID": 1
	},
	{
		"title": "Ablative Material: Thermal Protection",
		"tags": "",
		"body": "Ablative material, designed to remove the heat of reentry, is inserted into each one of the hexagonal honeycomb sections. The material, a glass and quartz reinforced epoxy material, contains phenolic micro balloons to facilitate application and reduce density. <<image 13>> \nAt launch, the heat shield has several outer coverings: a pore seal, a white, reflective moisture barrier, and a silver Mylar thermal coating. Under the combined influence of aerodynamic heating and pressure, the outer layers and a portion of the ablative material gradually oxidizes and vaporizes, removing heat in the process.<<image 14>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1241,
			"y": -1275
		},
		"colorID": 1
	},
	{
		"title": "Compression Pads and Tension Ties",
		"tags": "",
		"body": "The command module aft heat shield has six high-density fiberglass-laminate pads to connect the command module to the service module. Three are compression pads (alternating with three tension tie pads) arranged around the outer circumference of the shield. The compression pads allowed the service and command modules to rest against one another safely and securely. The tension tie pads accept a special bolt to attach the two component spacecraft together. The tension tie bolts are severed by an explosive cutting mechanism triggered from the command module prior to reentry. <<image 15>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2579,
			"y": -1048
		},
		"colorID": 1
	},
	{
		"title": "A Series of Parachutes Slows the Descent",
		"tags": "",
		"body": "At 24,000 feet a pair of mortars located above the side hatch launch two white conical-ribbon parachutes called drogue chutes. These chutes, with a canopy diameter of 16.5 feet, begin slowing the command modules rate of descent from 300 to 175 miles an hour. The drogue chutes allow a second set of chutes to be deployed at 10,000 feet. <<image 16>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2351,
			"y": -1044
		},
		"colorID": 1
	},
	{
		"title": "Forward Heat Shield: Jettisoned During Reentry",
		"tags": "",
		"body": "The forward heat shield (not preserved) is jettisoned during reentry, exposing the forward compartment. This allows the Earth landing subsystem equipment to be deployed in order to bring the spacecraft safely back to Earth. The forward heat shield was not recovered and is the only portion missing from Columbia. <<image 17>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -2132,
			"y": -1043
		},
		"colorID": 1
	},
	{
		"title": "Aids for Ocean Recovery",
		"tags": "",
		"body": "Astronauts could release a yellow/green dye into the water to aid recovery divers in locating the command module. The 12-foot long swimmer umbilical was used to connect divers communications equipment to the command module, allowing an exchange between astronauts and recovery workers. <<image 18>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1913,
			"y": -1044
		},
		"colorID": 1
	},
	{
		"title": "Pilot Parachutes Deploy the Main Parachutes",
		"tags": "",
		"body": "Three small white parachutes are used to deploy the main parachutes at 10,000 feet. The three main ring sail parachutes reduce the spacecraft speed from 175 to 22 miles an hour as it lands in the water. <<image 19>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1691,
			"y": -1042
		},
		"colorID": 1
	},
	{
		"title": "Forward Compartment",
		"tags": "",
		"body": "The forward compartment is covered by the forward heat shield or apex cover. This is jettisoned at 24,000 feet. The compartment is constructed of four 90-degree segments arranged around the perimeter of the forward access tunnel. Most of the equipment in the forward compartment consists of components of the earth landing and recovery subsystem (ELS). The segments that contained the main Parachutes and righting spheres are now empty. Items remaining in the fourth segment include mortars for expelling the drogue parachutes, equipment for locating the command module and communications once landed in the ocean, and negative pitch reaction control system engines. <<image 20>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1475,
			"y": -1044
		},
		"colorID": 1
	},
	{
		"title": "Crew Access Hatch: Exterior Features",
		"tags": "",
		"body": "The hatch can be opened by pumping a ratcheted handle on the interior or opened with a special tool from the outside. The hatch is secured by 15 latches around the periphery of the door. <<image 21>> [[Back|Apollo Command Module Carrier]]",
		"position": {
			"x": -1252,
			"y": -1043
		},
		"colorID": 1
	}
]